#ifndef __NRF24L01_H
#define __NRF24L01_H
/***********************************************************************************************************************************
 ** 【代码编写】  魔女开发板团队
 ** 【淘    宝】  魔女开发板       https://demoboard.taobao.com
 ***********************************************************************************************************************************
 ** 【文件名称】  bsp_NRF24L01.h 
 **
 ** 【 功  能 】  NRF24L01通信底层驱动
 **
 ** 【适用环境】  STM32F407 + keil5 + HAL库 
 **
 ** 【 约  定 】  
 **
 ** 【 CubeMX 】  在h文件中修改引脚、SPI端口号，即可; 
 **               无需通过CubeMX、CubeIDE对本模块进行引脚、SPI的配置; 
 **               这样做的目的：为了简化文件的复制、移植; 
 **               bsp_NRF24L01.c中，已对初始化、通信的收发，都编写好了处理函数 ，调用h文件中声明的函数，即可完成初始化、收发通信等;
 **               注意冲突：IRQ引脚需要使用到中断，在本C文件中，已写好了中断服务函数，注意不要使用与CubeMX工程中相冲突的引脚、中断编号，否则编译时会提示中断服务函数的重复定义;
 **
 ** 【移植说明】  1- 复制本工程的NRF24L01文件夹，到目标工程文件夹中;
 **               2- 添加文件路径：  Keil > Option > C/C++ > Include Paths，选择NRF24L01的目录路径;
 **               3- 添加文件到工程: Keil > 左侧工程管理器中双击目标文件夹 > 选择 bsp_NRF24L01.c;
 **               4- 添加文件引用:   #include "bsp_NRF24L01.h＂，即哪个文件要用此功能，就在其代码文件顶部添加引用;
 **
 ** 【引脚解释】  VCC  -  3.3V; 千万别接子5V, 马上ByeBye
 **               GND  -  GND
 **               CE   -  工作模式控制; 置低:配置寄存器、置高:10us后进入设定的工作模式(发送、接收等)
 **               IRQ  -  中断信号引脚，闲时是高电平，芯片发生中断时会把其拉至低电平; 发生中断时的3种情况：发送成功、重发次数溢出、接收到新一帧数据
 **               SCK  -  SPI通信，时钟信号线
 **               CS   -  SPI通信, 片选线; 闲时高电平，通信时手动置低电平;
 **               MISO -  SPI通信，主机输入从机输出
 **               MOSI -  SPI通信，主机输出从机输入
 **
 ** 【引脚修改】  1-在bsp_NRF24L01.h的宏定义中修改需要使用的引脚; 
 **               2-IRQ引脚的修改，要特别留意, 别和CubeMX工程中的其它中断引脚重叠中断号，否则编译时会冲突; 中断号可以csdn刨文章;
 **               3-SPI端口，也在此文件的宏定义中修改;
 **
 ** 【参数修改】  1-在bsp_NRF24L01.h的宏定义中: 频率、CRC、波特率、发送功率;
 **               2-通信双方上述前3个参数，必须一样，才能通信;
 **               3-发射功率、波特率，这两个参数会影响通信距离，具体请按需另行实测;
 **
 ** 【初 始 化】  1-初始化，需要2个函数：①初始化、②设置接收通道地址;
 **               2-调用 NRF24L01_Init()，即可对h文件中宏定义的引脚、SPI端口进行初始化; 
 **               3-调用 NRF24L01_SetAddr(uint8_t* 5字节地址, uint8_t 通道0~5)，设置模块自己接收通道x的地址值; NRF24L01其实有6个接收通道, 通道0和1能自由地设置5个字节的地址值，通道2~5的高4字节要和通道1的高4字节相同，只能自由设定最低1字节的值;
 **               4-设置自己的地址后，函数会配置为接收模式，模块开始自动对空中信号进行监听; 
 **
 ** 【如何发送】  1-发送，需要2个函数：①设置发送地址、②发送数据
 **               2-调用 NRF24L01_SetTxAddr(uint8_t*  5字节地址值)，设置对面接收方的地址; 参数可以传入数组，也可以用传入字符串，建议使用后者，这样更便于命名和记忆。
 **               3-调用 NRF24L01_SendData(uint8_t* 数据, uint8_t 字节数)，函数将自动切换到发送模式，并按设定的频率、地址等参数，把数据发出; 
 **               4-关于判断发送成功，当对方成功收到数据后，会发回ack信号 ; 调用 NRF24L01_GetSendStatus()，通过其返回值对比，可以知道发送的各个状态：0-无效值、1-发送成功、2-发送失败、3-正在发送、4-字节数不在有效范围(1~31)、5-NRF24L01尚未初始化
 **               5-NRF24L01限定每包最大32字节; 发送函数内部利用[0]存放字节数，[1]起存放有效数据，因此每包最大发送31字节; 用户无需外部处理上述操作，只需传入原始数据、原始的字节数即可，函数内部会自动处理成：[0]-字节数、[1]起-有效数据; 
 **               6-每次发送数据后，发送成功、发送失败，都会自动切换回接收模式继续监听空中信号; 
 **               7-每包发送间隔时间：建议间隔1ms以上; 因为spi传输、空中传输、工作模式这三项，都需要时间; 
 **
 ** 【如何接收】  1-接收，需要3个函数：①获取接收字节数、②获取数据地址、③清零接收
 **               2-调用函数 NRF24L01_GetRxNum(void), 返回接收的字节数:0~31; 单位:字节; 0-无接收、非0-新一帧数据的字节数;
 **               3-利用返回值判断接收：返回值>0，即为接收到新一帧数据; 
 **               4-返回值>0时，调用函数 NRF24L01_GetRxData(), 即可返回当前一帧数据的缓存地址;
 **               5-每次处理完一帧数据后，调用 NRF24L01_ClearRx(), 即可清0接收字节数、数据，以方便下一帧数据的接收判断工作; 
 **
 ** 【调试经验】  1-不要和其它功能联合调试，以避免大量的调试时间消耗; 先调通了基本的收发，再一点点增加其它功能，如按键发送、协议等;
 **               2-调试时，先把两个开发板+模块，放在桌面上调试，不要间隔太远，以减少信号衰减掉包问题的发生;
 **               3-掉包问题，一般是这几种原因：双方空中参数不一致、间隔太远、发送间隔太短、地址错误、接收判断间隔太久;
 **               4-信号衰减，主要受限于收发间的障碍物; 空旷地方能有20米左右，室内实测，一堵墙10米内，两堵墙6米内; 
 **
 ** 【主要更新】  2024-02-21  修改发送函数、接收函数: 利用数据包的第1字节存放有效字节数，第2字节起存放有效数据; 
 **               2024-02-19  简化函数名称、优化接收处理;
 **               2024-02-17  从标准库中更新至HAL库;
 **               
 **
************************************************************************************************************************************/
#include "stm32f4xx_hal.h"
#include <stdio.h>
#include "bsp_UART.h"




/*****************************************************************************
 ** SPI端口
****************************************************************************/
// spi_port
#define  NRF24L01_SPI               SPI1                  // SPI端口; 如果使用其它端口，下面的引脚也要按需修改; 具体SPI的分布，可查对芯片数据手册第45页(英文版的页码);
// SPI_AF
#define  NRF24L01_SPI_AF            GPIO_AF5_SPI1         // 引脚复用编号; 参数范围：GPIO_AF5_SPI1、GPIO_AF5_SPI2、GPIO_AF6_SPI3



/*****************************************************************************
 ** 引脚使用
****************************************************************************/
// CSN
#define  NRF24L01_CS_GPIO           GPIOB                 // CS, SPI片选引脚; 不受限于SPI，可以自由选择引脚
#define  NRF24L01_CS_PIN            GPIO_PIN_2            //
// CLK
#define  NRF24L01_SCK_GPIO          GPIOA                 // SCK, SPI时钟同步引脚; 受限于不同的SPI端口，请根据SPI端口修改
#define  NRF24L01_SCK_PIN           GPIO_PIN_5              
// MISO                                               
#define  NRF24L01_MISO_GPIO         GPIOA                 // MISO, SPI主机输入从机输出; 受限于不同的SPI端口，请根据SPI端口修改
#define  NRF24L01_MISO_PIN          GPIO_PIN_6              
// MOSI                                               
#define  NRF24L01_MOSI_GPIO         GPIOA                 // MOSI, SPI主机输出从机输入; 受限于不同的SPI端口，请根据SPI端口修改
#define  NRF24L01_MOSI_PIN          GPIO_PIN_7
// CE
#define  NRF24L01_CE_GPIO           GPIOA                 // CE, NRF24L01工作模式控制引脚; 不受限于SPI，可以自由选择引脚
#define  NRF24L01_CE_PIN            GPIO_PIN_3
// IRQ
#define  NRF24L01_IRQ_GPIO          GPIOB                 // IRQ, NRF24L01信号中断引脚; 不受限于SPI，可以自由选择引脚，但注意不要和CubeMX工程的其它中断引脚使用相同的中断编号组
#define  NRF24L01_IRQ_PIN           GPIO_PIN_11           // 发生中断时的3种情况：发送成功、重发次数溢出、接收到新一帧数据
#define  NRF24L01_EXTI_IRQn         EXTI15_10_IRQn        // 中断号
#define  NRF24L01_IRQ_IRQHANDLER    EXTI15_10_IRQHandler  // 中断服务函数



/*****************************************************************************
 ** 模块通信参数(空中参数)　
 ** 通信时收发双方下述前3个参数，必须一样，才能通信
 ** 一般不用修改，更不建议新手修改
 *****************************************************************************/
#define NRF24L01CONFIG_CH            36                   // 频率(MHz)：  参数范围<126, 实际使用频率：2400+x; 建议使用2的倍数
#define NRF24L01CONFIG_CRC           16                   // CRC校验位：  可选参数：8、16
#define NRF24L01CONFIG_RF_DR          0                   // 射频波特率： 0:1Mbps、1:2Mbps、4:250Kbps
#define NRF24L01CONFIG_RF_PWR         7                   // 发射功率：   7:7dBm, 6:4dBm, 5:3dBm, 4:1dBm, 3:0dBm, 2:-4dBm, 1-6dBm, 0:-12dBm





/*****************************************************************************
 ** 声明  全局函数
****************************************************************************/
// 一定要用到的函数
uint8_t   NRF24L01_Init(void);                                    // NRF24L01初始化, 并进入接收模式
void      NRF24L01_SetMyAddr(uint8_t* pAddr, uint8_t channel);    // 设置接收通道的地址，即模块自己的接收地址, 5个字节; 参数：地址值(5个字节)、通道(0~5); 模块共有6个独立的接收通道, 可以设置不同的接收地址; 注意:通道2~5的前4个字节必须与通道1相同，因此在设置通道2~5时函数会复制通道1的前4字节，只对第5字节进行赋值;
void      NRF24L01_SetTxAddr(uint8_t* pAddr);                     // 设置发送的地址，5个字节 (即对面接收方的地址)
void      NRF24L01_SendData(uint8_t *pData, uint8_t len);         // 发送一包数据; 参数：数据地址、字节数(最大32-1); 特别地注意：函数内会处理成：[0]-字节数、[1]起-有效数据
uint8_t   NRF24L01_GetRxNum(void);                                // 获取接收的字节数; 返回值：0~31，单位：字节; 0-无接收、非0-新一帧数据字节数
uint8_t*  NRF24L01_GetRxData(void);                               // 获取接收到的数据;  特别注意：[0]-字节数、[1]起-有效数据
void      NRF24L01_ClearRx(void);                                 // 清0接收; 即清0接收字节数、数据; 每次处理完一帧数据后，记得调用本函数清0
// 辅助功能，非必需要的                                
void      NRF24L01_ReadConfig(void);                              // 读取当前的的参数配置，并printf, 以方便观察调试; (辅助功能，非必需的);
uint8_t   NRF24L01_GetSendStatus(void);                           // 获取发送状态; (辅助功能，非必需的); 0-无效值、1-发送成功、2-发送失败、3-正在发送、4-字节数不在有效范围(1~31)、5-NRF24L01尚未初始化
uint8_t   NRF24L01_GetRxChannel(void);                            // 获取最后一包接收数据所用的通道; 返回：0~5; (辅助功能，非必需的)

#endif

