#ifndef __BSP_BH1750_H_
#define __BSP_BH1750_H_
/**==================================================================================================================
 **【文件名称】  bsp_BH1750.h
 **【功能测试】  BH1750-光强度传感器数据采集
 **==================================================================================================================
 **【实验平台】  STM32F407 + KEIL5.31 + BH1750
 **
 **【实验操作】  1-模块接线，VCC  接  3.3V
 **                          GND  接  GND
 **                          SCL  接  PC0; 没要求，在h文件里修改
 **                          SDA  接  PC1; 没要求，在h文件里修改
 **                          ADDR 接  空置或GND; 用于决定器件的地址，接GND或空置时地址为0x46，接3.3V时地址为0xB8
 **
 **【文件移植】  步骤1-复制文件：可复制bsp_BH1750.c和bsp_BH1750.h两个文件，或复制BH1750文件夹，保存到所需工程目录文件夹下；
 **              步骤2-添加文件：在keil工各程左侧文件管理器中，双击某文件夹，以添加bsp_BH1750.c文件;
 **              步骤3-添加路径：点击魔术棒工具按钮，在“c/c++"选项页中，点击”Include Path"后面的按键，以添加文件存放所在路径(是文件夹，不是文件);
 **　　　　　    步骤4-添加引脚：在需要BH1750输出的代码文件头部，添加：#include "bsp_BH1750.h";
 **
 **
 **【函数使用】  初始化：  BH1750_Init( );       // 初始化BH1750的IIC引脚; 注意：本代码采用软件IIC，引脚在bsp_BH1750.h中修改
 **              获取数据：BH1750_GetData( );    // 获取BH1750的光度值; 注意: 返回float类型数据
 **
 **
 **【备注说明】  代码版权归魔女科技所有，请勿商用，谢谢！
 **              https://demoboard.taobao.com
 ====================================================================================================================*/
#include "stm32f4xx_hal.h"                 // 引用 HAL库的底层支持文件
#include <stdio.h>



/*****************************************************************************
 ** 移植参数区
****************************************************************************/
// SCL
#define    BH1750_SCL_GPIO   GPIOC         // 模拟IIC, 时钟引脚
#define    BH1750_SCL_PIN    GPIO_PIN_0
// SDA
#define    BH1750_SDA_GPIO   GPIOC         // 模拟IIC，数据引脚
#define    BH1750_SDA_PIN    GPIO_PIN_1
// IIC器件地址
#define    BH1750_ADDR       0x46          // 器件在IIC总线中的从机地址, 根据ADDR引脚不同修改：当ADDR引脚接GND或空置时地址为0x46，接3.3V时地址为0xB8; 最后写方向位0x46+0;读方向0x46+1;

//END 移植 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++




/*****************************************************************************
 ** 声明  全局函数
****************************************************************************/
void  BH1750_Init(void);                   // 初始化BH1750：配置模拟IIC引脚、发送初始化指令
float BH1750_GetData(void);                // 读取BH1750数据，返回光度值

#endif
